name: "bert"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
 {
    name: "input_ids"
    data_type: TYPE_INT64
    #-1 in shape means dynamic axis, aka this dimension may change from one query to another
    dims: [-1, -1]
  } ,
{
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [-1, -1]
  }
]
output {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [-1, 2]
  }

instance_group [{ kind: KIND_CPU }]